Tekla Open API Reference for Tekla Structures 2025
ParametricObject_ObjectBoundingBox Class
 The ParametricObject_ObjectBoundingBox class contains the object bounding box (OBB) definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.ParametricObject_ObjectBoundingBox
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ParametricObject_ObjectBoundingBox : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class ParametricObject_ObjectBoundingBox
	Inherits ReferenceModelObjectAttribute
The ParametricObject_ObjectBoundingBox type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
yDir
 The Y direction.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace